{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "inbound_nodes": []}, {"name": "input-reshape", "class_name": "Reshape", "config": {"name": "input-reshape", "trainable": true, "dtype": "float32", "target_shape": [1024, 1, 1]}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [512, 1], "strides": [4, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input-reshape", 0, 0, {}]]]}, {"name": "conv1-BN", "class_name": "BatchNormalization", "config": {"name": "conv1-BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv1-maxpool", "class_name": "MaxPooling2D", "config": {"name": "conv1-maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv1-BN", 0, 0, {}]]]}, {"name": "conv1-dropout", "class_name": "Dropout", "config": {"name": "conv1-dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1-maxpool", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1-dropout", 0, 0, {}]]]}, {"name": "conv2-BN", "class_name": "BatchNormalization", "config": {"name": "conv2-BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "conv2-maxpool", "class_name": "MaxPooling2D", "config": {"name": "conv2-maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv2-BN", 0, 0, {}]]]}, {"name": "conv2-dropout", "class_name": "Dropout", "config": {"name": "conv2-dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2-maxpool", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2-dropout", 0, 0, {}]]]}, {"name": "conv3-BN", "class_name": "BatchNormalization", "config": {"name": "conv3-BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "conv3-maxpool", "class_name": "MaxPooling2D", "config": {"name": "conv3-maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv3-BN", 0, 0, {}]]]}, {"name": "conv3-dropout", "class_name": "Dropout", "config": {"name": "conv3-dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv3-maxpool", 0, 0, {}]]]}, {"name": "conv4", "class_name": "Conv2D", "config": {"name": "conv4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3-dropout", 0, 0, {}]]]}, {"name": "conv4-BN", "class_name": "BatchNormalization", "config": {"name": "conv4-BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4", 0, 0, {}]]]}, {"name": "conv4-maxpool", "class_name": "MaxPooling2D", "config": {"name": "conv4-maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv4-BN", 0, 0, {}]]]}, {"name": "conv4-dropout", "class_name": "Dropout", "config": {"name": "conv4-dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv4-maxpool", 0, 0, {}]]]}, {"name": "conv5", "class_name": "Conv2D", "config": {"name": "conv5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4-dropout", 0, 0, {}]]]}, {"name": "conv5-BN", "class_name": "BatchNormalization", "config": {"name": "conv5-BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5", 0, 0, {}]]]}, {"name": "conv5-maxpool", "class_name": "MaxPooling2D", "config": {"name": "conv5-maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv5-BN", 0, 0, {}]]]}, {"name": "conv5-dropout", "class_name": "Dropout", "config": {"name": "conv5-dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv5-maxpool", 0, 0, {}]]]}, {"name": "conv6", "class_name": "Conv2D", "config": {"name": "conv6", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [64, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5-dropout", 0, 0, {}]]]}, {"name": "conv6-BN", "class_name": "BatchNormalization", "config": {"name": "conv6-BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv6", 0, 0, {}]]]}, {"name": "conv6-maxpool", "class_name": "MaxPooling2D", "config": {"name": "conv6-maxpool", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv6-BN", 0, 0, {}]]]}, {"name": "conv6-dropout", "class_name": "Dropout", "config": {"name": "conv6-dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv6-maxpool", 0, 0, {}]]]}, {"name": "transpose", "class_name": "Permute", "config": {"name": "transpose", "trainable": true, "dtype": "float32", "dims": [2, 1, 3]}, "inbound_nodes": [[["conv6-dropout", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["transpose", 0, 0, {}]]]}, {"name": "classifier", "class_name": "Dense", "config": {"name": "classifier", "trainable": true, "dtype": "float32", "units": 360, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["classifier", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "classifier/kernel", "shape": [1024, 360], "dtype": "float32"}, {"name": "classifier/bias", "shape": [360], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [512, 1, 1, 512], "dtype": "float32"}, {"name": "conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1-BN/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv1-BN/beta", "shape": [512], "dtype": "float32"}, {"name": "conv1-BN/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv1-BN/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2/kernel", "shape": [64, 1, 512, 64], "dtype": "float32"}, {"name": "conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2-BN/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2-BN/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2-BN/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2-BN/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv3/kernel", "shape": [64, 1, 64, 64], "dtype": "float32"}, {"name": "conv3/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3-BN/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv3-BN/beta", "shape": [64], "dtype": "float32"}, {"name": "conv3-BN/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv3-BN/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv4/kernel", "shape": [64, 1, 64, 64], "dtype": "float32"}, {"name": "conv4/bias", "shape": [64], "dtype": "float32"}, {"name": "conv4-BN/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv4-BN/beta", "shape": [64], "dtype": "float32"}, {"name": "conv4-BN/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv4-BN/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv5/kernel", "shape": [64, 1, 64, 128], "dtype": "float32"}, {"name": "conv5/bias", "shape": [128], "dtype": "float32"}, {"name": "conv5-BN/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv5-BN/beta", "shape": [128], "dtype": "float32"}, {"name": "conv5-BN/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv5-BN/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv6/kernel", "shape": [64, 1, 128, 256], "dtype": "float32"}, {"name": "conv6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv6-BN/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv6-BN/beta", "shape": [256], "dtype": "float32"}, {"name": "conv6-BN/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv6-BN/moving_variance", "shape": [256], "dtype": "float32"}]}]}